ES1C/src/InformationRegisters/md_НастройкиРазмещенияОтчетаСравнениеВерсий/md_НастройкиРазмещенияОтчетаСравнениеВерсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>md_НастройкиРазмещенияОтчетаСравнениеВерсий</name>
  <resources>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидФормы</name>
    <type>
      <types>EnumRef.md_ВидФормы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>CatalogRef.md_НастройкиСравненияВерсий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ES1C/src/Catalogs/md_СервераElasticsearch/md_СервераElasticsearch.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>md_СервераElasticsearch</name>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ES1C/src/Catalogs/md_НастройкиСравненияВерсий/md_НастройкиСравненияВерсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>md_НастройкиСравненияВерсий</name>
  <attributes>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверES</name>
    <type>
      <types>CatalogRef.md_СервераElasticsearch</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексES</name>
    <type>
      <types>CatalogRef.md_ИндексыElasticsearch</types>
    </type>
  </attributes>
</mdclass:Catalog>

ES1C/src/CommonModules/md_ВерсионированиеElasticsearchПовтИсп/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Интеграция elasticsearch (сервер, повторное использование)
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция НастройкиРазмещенияПоТипу(ТипМетаданных, ВидФормы) Экспорт
	
	НастройкиРазмещения = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипМетаданных", ТипМетаданных);
	Запрос.УстановитьПараметр("ВидФормы", ВидФормы);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВсеНастройкиСравнения.Настройка КАК Настройка,
		|	ЕстьNull(НастройкаСравнения.Ключ, """") КАК ИмяКоманды,
		|	ЕстьNull(НастройкаСравнения.Представление, """") КАК ЗаголовокКнопкиФормы,
		|	ЕстьNull(md_ИндексыElasticsearch.Имя, """") КАК ИмяИндекса,
		|	ЕстьNull(md_СервераElasticsearch.АдресСервера, """") КАК АдресСервера,
		|	ЕстьNull(md_СервераElasticsearch.Порт, """") КАК ПортСервера,
		|	ЕстьNull(md_СервераElasticsearch.Ссылка, Значение(Справочник.md_СервераElasticsearch.ПустаяСсылка)) КАК СерверES,
		|	ЕстьNull(md_ИндексыElasticsearch.Ссылка, Значение(Справочник.md_ИндексыElasticsearch.ПустаяСсылка)) КАК ИндексES
		|
		|ИЗ
		|	РегистрСведений.md_НастройкиРазмещенияОтчетаСравнениеВерсий КАК ВсеНастройкиСравнения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.md_НастройкиСравненияВерсий КАК НастройкаСравнения
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.md_ИндексыElasticsearch КАК md_ИндексыElasticsearch
		|			ПО НастройкаСравнения.ИндексES = md_ИндексыElasticsearch.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.md_СервераElasticsearch КАК md_СервераElasticsearch
		|			ПО НастройкаСравнения.СерверES = md_СервераElasticsearch.Ссылка
		|		ПО ВсеНастройкиСравнения.Настройка = НастройкаСравнения.Ссылка
		|ГДЕ
		|	ВсеНастройкиСравнения.ТипМетаданных = &ТипМетаданных
		|	И ВсеНастройкиСравнения.ВидФормы = &ВидФормы
		|	И ВсеНастройкиСравнения.Используется";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат НастройкиРазмещения;
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НастройкаРазмещения = Новый Структура("ИмяКоманды, ЗаголовокКнопкиФормы");
		ЗаполнитьЗначенияСвойств(НастройкаРазмещения, Выборка);
		
		ПараметрыПодключения = Новый Структура("ИмяИндекса, АдресСервера, ПортСервера, СерверES, ИндексES");
		ЗаполнитьЗначенияСвойств(ПараметрыПодключения, Выборка);
		
		НастройкаРазмещения.Вставить("ПараметрыПодключения", ПараметрыПодключения);
		
		НастройкиРазмещения.Добавить(НастройкаРазмещения);
		
	КонецЦикла;
	
	Возврат НастройкиРазмещения;
	
КонецФункции

#КонецОбласти
